;; -*- coding:utf-8 -*- ;;
(clear-all)

(define-model 两个数相加的认知模型
  ; 参数设置
  (sgp :esc t :lf .05 :trace-detail low) ;; :trace-filter production-firing-only)
  
  (chunk-type 顺次相邻的数对 较小的数 较大的数)
  (chunk-type 两个数的加法 被加数 加数 和数 增量计数器)

  (add-dm
    (a isa 顺次相邻的数对 较小的数 0 较大的数 1)
    (b isa 顺次相邻的数对 较小的数 1 较大的数 2)
    (c isa 顺次相邻的数对 较小的数 2 较大的数 3)
    (d isa 顺次相邻的数对 较小的数 3 较大的数 4)
    (e isa 顺次相邻的数对 较小的数 4 较大的数 5)
    (f isa 顺次相邻的数对 较小的数 5 较大的数 6)
    (g isa 顺次相邻的数对 较小的数 6 较大的数 7)
    (h isa 顺次相邻的数对 较小的数 7 较大的数 8)
    (i isa 顺次相邻的数对 较小的数 8 较大的数 9)
    (j isa 顺次相邻的数对 较小的数 9 较大的数 10)
    (模型目标 isa 两个数的加法 被加数 5 加数 4))

  (p 加法初始
    =goal>
      isa              两个数的加法
      被加数           =数字甲
      加数             =数字乙
      和数              nil
  ==>
    =goal>             
      和数             =数字甲
      增量计数器       0
    +retrieval>        
      isa              顺次相邻的数对
      较小的数         =数字甲
    !output!           (准备计算 =数字甲 + =数字乙)
  )  

  (p 加法终止          
    =goal>             
      isa              两个数的加法
      被加数           =被加数
      增量计数器       =加数
      加数             =加数
      和数             =最终和数
  ==>
    =goal>             
      增量计数器       nil
    !output!           (计数器数值 =加数 加数 =加数)
    !output!           (最终答案 =被加数 + =加数 = =最终和数)
  )  

  (p 增量计数器加一  
    =goal>             
      isa              两个数的加法
      加数             =加数
      和数             =和数
      增量计数器       =增量计数器
    =retrieval>        
      isa              顺次相邻的数对
      较小的数         =增量计数器
      较大的数         =下一步数到几
  ==>
    =goal>             
      增量计数器       =下一步数到几
    +retrieval>        
      isa              顺次相邻的数对
      较小的数         =和数
    !output!           (计数器数值 =增量计数器 加数 =加数)
  )  

  (p 增大和数          
    =goal>             
      isa              两个数的加法
      和数             =和数
      增量计数器       =增量计数器
      - 加数           =增量计数器
    =retrieval>        
      isa              顺次相邻的数对
      较小的数         =和数
      较大的数         =下一步的和数
  ==>
    =goal>             
      和数             =下一步的和数
    +retrieval>        
      isa              顺次相邻的数对
      较小的数         =增量计数器
  )

  (goal-focus 模型目标)
)
